// 12. Добавьте валидацию формы на странице регистрации из задачи 4(HTML, CSS).

// 1. Кнопка Submit должна быть disabled до тех пор пока данные в форме не корректны.
// 2. Все поля формы обезательны к заполнению и не должны быть пустые
// 3. Поле Email должно принимать только валидные email адресса
// 4. Пароль должен быть минимум 8 символов и содержать буквы нижнего/верхнего регистра, цифры и хотя бы 1 спец символ.
// 5. Поле Avatar принемает только файлы с расширением .png размер не больше 1Mb
// 6. В случае ошибок под каждым input появляеться тест с причиной ошибки.
